fademike/fly_drone/stm32f103_FlyBoard/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <string.h>		// for strlen
#include <stdio.h>		// for sprintf

#include <math.h>		// for abs and other

//#include "Kalman.h"
#include "MPU9250.h"

#include "si4463.h"
#include "radio_config_Si4463.h"

//#include "uSD.h"
#include "fast_atan.h"

#include "debug.h"

#include "params.h"
#include "system.h"
#include "mavlink_handler.h"

//volatile int silence_cnt=0;

#include "fast_atan.h"
#define atan2 atan2LUT

//#include "filter.h"

//#define IMU

//#ifdef IMU
#include "imu.h"

//
//volatile uint32_t imu_timer = 0;
//
//
//#define CONV_TO_RAD (M_PI/180.0)
//#define CONV_TO_DEG (180.0/M_PI)
//
//struct myAngel {
//    double x;
//    double y;
//    double z;
//};
//
//#endif



#include "ModemControl.h"
#include "MotorControl.h"
#include "nRF24.h"


#if MOTOR_TYPE == MOTOR_BRUSHLESS

#define TIM_PERIOD 4000	//20000
#define TIM_PRESCALER 63

#endif

#if MOTOR_TYPE == MOTOR_BRUSHED

#define TIM_PERIOD 2000
#define TIM_PRESCALER 0


#endif


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */



/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

IWDG_HandleTypeDef hiwdg;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */






/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_IWDG_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM4_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI2_Init(void);
static void MX_I2C2_Init(void);
/* USER CODE BEGIN PFP */



/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// if i2c interface not disabled, then read/write uSD card by SPI will be not correct
#define EN_I2C if(CONFLICT)SET_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C1EN) 		//disable I2c
#define DIS_I2C if(CONFLICT)CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C1EN) 	//disable I2c


#define TPS1 HAL_GPIO_WritePin(PIN_TEST_GPIO_Port, PIN_TEST_Pin, GPIO_PIN_SET)
#define TPS0 HAL_GPIO_WritePin(PIN_TEST_GPIO_Port, PIN_TEST_Pin, GPIO_PIN_RESET)
#define TPS2_1 HAL_GPIO_WritePin(PIN_TEST2_GPIO_Port, PIN_TEST2_Pin, GPIO_PIN_SET)
#define TPS2_0 HAL_GPIO_WritePin(PIN_TEST2_GPIO_Port, PIN_TEST2_Pin, GPIO_PIN_RESET)

void test_set(int set){
	if (set !=0) HAL_GPIO_WritePin(PIN_TEST_GPIO_Port, PIN_TEST_Pin, GPIO_PIN_SET);
		else HAL_GPIO_WritePin(PIN_TEST_GPIO_Port, PIN_TEST_Pin, GPIO_PIN_RESET);
	if (set !=0) HAL_GPIO_WritePin(PIN_TEST2_GPIO_Port, PIN_TEST2_Pin, GPIO_PIN_SET);
		else HAL_GPIO_WritePin(PIN_TEST2_GPIO_Port, PIN_TEST2_Pin, GPIO_PIN_RESET);
	if (set !=0) HAL_GPIO_WritePin(PIN_TEST3_GPIO_Port, PIN_TEST3_Pin, GPIO_PIN_SET);
		else HAL_GPIO_WritePin(PIN_TEST3_GPIO_Port, PIN_TEST3_Pin, GPIO_PIN_RESET);
	if (set !=0) HAL_GPIO_WritePin(BTN1_GPIO_Port, BTN1_Pin, GPIO_PIN_SET);
		else HAL_GPIO_WritePin(BTN1_GPIO_Port, BTN1_Pin, GPIO_PIN_RESET);

}

void TimerIRQ_Handler (void){
//	sendMSG_after(100, "en:%d, st:%d\n\r", ThreadFly[thread_MPU_ag].enabled, ThreadFly[thread_MPU_ag].status);																									//TIM4!!!!!!!!!!!!1
}

void SYS_myTick(void)	// IRQ 1 ms
{
	//reset timer for calculate us
	if (htim1.Instance != 0)__HAL_TIM_SET_COUNTER(&htim1, 0);

}

#include <stdarg.h>

void Printf(const char *fmt, ...)
{
	static char buf[256];
	va_list lst;

	va_start(lst, fmt);
	vsprintf(buf, fmt, lst);
	va_end(lst);

	HAL_UART_Transmit(&huart1, (unsigned char *)buf, strlen(buf), 500);
}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_SPI1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_USART1_UART_Init();
  MX_IWDG_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_I2C1_Init();
  MX_SPI2_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  //CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C1EN); //disable I2c		//TODO uncomment

  if (CONFLICT)DIS_I2C;

  //HAL_UART_Transmit(&huart1, "hellooooooo", 10, 500);

